000_РОЗНИЦА_ЦЕНТР/src/Enums/НазначенияТовара/НазначенияТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТовара</name>
  <enumValues>
    <name>ТоварОбычный</name>
    <comment>Разрешена продажа только для основной организации</comment>
  </enumValues>
  <enumValues>
    <name>ТоварСпециальный</name>
    <comment>Разрешены продажи только для НЕ основной организации</comment>
  </enumValues>
  <enumValues>
    <name>ТоварУниверсальный</name>
    <comment>Разрешена продажа БЕЗ ограничений</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/РозничныеПродажиКлиентПовтИсп/Module.bsl
//	LNK 26.04.2017 15:21:20
Функция РеквизитыМагазина(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РеквизитыМагазина(Магазин, ДатаСреза);

КонецФункции // РеквизитыМагазина()

//	LNK 20.09.2023 09:19:58
Функция РеквизитыФонда(Фонд, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РеквизитыФонда(Фонд, ДатаСреза);

КонецФункции

//	LNK 26.04.2017 10:55:08
Функция РазрешитьПродажуУслуг(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьПродажуУслуг(Магазин, ДатаСреза);

КонецФункции // РазрешитьПродажуУслуг()

//	LNK 27.04.2017 10:59:23
Функция РазрешитьПродажуТовара(НазначениеТовара, РазрешитьПродажуТоварОбычный, РазрешитьПродажуТоварСпециальный)	Экспорт

	ПричинаПроблемы = "";

	Если НазначениеТовара = ПредопределенноеЗначение("Перечисление.НазначенияТовара.ПустаяСсылка")
	ИЛИ  НазначениеТовара = ПредопределенноеЗначение("Перечисление.НазначенияТовара.ТоварОбычный") Тогда

		Если НЕ РазрешитьПродажуТоварОбычный = Истина Тогда

			ПричинаПроблемы = "продажа товаров «АНТ» (обычный) НЕ разрешена!";

		КонецЕсли;

	ИначеЕсли НазначениеТовара = ПредопределенноеЗначение("Перечисление.НазначенияТовара.ТоварСпециальный") Тогда

		Если НЕ РазрешитьПродажуТоварСпециальный = Истина Тогда

			ПричинаПроблемы = "продажа товаров «СПЕЦ» (требуют спец.разрешения) НЕ разрешена!";

		КонецЕсли;

	ИначеЕсли НазначениеТовара = ПредопределенноеЗначение("Перечисление.НазначенияТовара.ТоварУниверсальный") Тогда

		Если НЕ РазрешитьПродажуТоварОбычный = Истина И НЕ РазрешитьПродажуТоварСпециальный = Истина Тогда

			ПричинаПроблемы = "продажа любого товара НЕ разрешена!";

		КонецЕсли;

	КонецЕсли;

	Возврат ПричинаПроблемы;

КонецФункции // РазрешитьПродажуТовара()

//	LNK 05.01.2018 08:38:55
Функция РазрешитьВерификациюПокупателей(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьВерификациюПокупателей(Магазин, ДатаСреза);

КонецФункции

//	LNK 07.02.2022 07:00:01
Функция ЗапретитьОбновлениеБонусныхБалловРМК(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.ЗапретитьОбновлениеБонусныхБалловРМК(Магазин, ДатаСреза);

КонецФункции

//	LNK 21.09.2023 05:45:22
Функция РазрешитьОтказВерификацииКонтрагента(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьОтказВерификацииКонтрагента(Магазин, ДатаСреза);

КонецФункции

//	LNK 22.07.2022 06:07:10
Функция ОграничитьОтгрузкуРеализованногоЗаказаПокупателя(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.ОграничитьОтгрузкуРеализованногоЗаказаПокупателя(Магазин, ДатаСреза);

КонецФункции

//	LNK 11.08.2022 05:48:01
Функция ОтключитьОграниченияПериодаПоКассовомуДню(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.ОтключитьОграниченияПериодаПоКассовомуДню(Магазин, ДатаСреза);

КонецФункции

//	LNK 13.09.2019 14:25:44
Функция РазрешитьОкруглениеВЧекеККМ(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьОкруглениеВЧекеККМ(Магазин, ДатаСреза);

КонецФункции

//	LNK 25.10.2023 06:17:58
Функция ЭтоУзелИнтернетМагазина()	Экспорт

	Возврат РозничныеПродажиСервер.ЭтоУзелИнтернетМагазина();

КонецФункции

//	LNK 06.08.2018 10:26:15
Функция ПолучитьШтриховойКодТовара(Номенклатура, Упаковка)	Экспорт

	Возврат РозничныеПродажиСервер.ПолучитьШтриховойКодТовара(Номенклатура, Упаковка);

КонецФункции // ПолучитьШтриховойКодТовара()

//	LNK 27.05.2019 09:36:10
Функция СписокКассККММагазина(Магазин)	Экспорт

	Возврат РозничныеПродажиСервер.СписокКассККММагазина(Магазин);

КонецФункции // СписокКассМагазина()
